{
    "promotions": [
        {
            "asin": "0002219417",
            "description": "Herman Wouks acclaimed novels include the Pulitzer Prize winning The Caine Mutiny; Marjorie Morningstar; Don't Stop the Carnival; Youngblood Hawke; The Winds of War; War and Remembrance; Inside, Outside; The Hope; and The Glory.--This text refers to theAudio CDedition.",
            "imUrl": "http://ecx.images-amazon.com/images/I/41qvc1Xmo3L.jpg",
            "price": 4.99,
            "title": "The Winds of War",
            "promotion": true,
            "promotionDiscount": 0.15
        },
        {
            "asin": "000222383X",
            "description": "Ashore without a command--and on half-pay to boot--Jack Aubrey's prayers are answered when Stephen Maturin shows up with a secret mission for him. The two men have been ordered to the Cape of Good Hope. There they hope to dislodge the French garrisons on the islands of Mauritius and La Reunion. Alas, two of their own colleagues--a dilettante and a martinet--prove to be nearly as great an obstacle as the French themselves.--This text refers to an out of print or unavailable edition of this title.",
            "imUrl": "http://ecx.images-amazon.com/images/I/51S6XET6X0L.jpg",
            "price": 9.99,
            "title": "The Mauritius Command",
            "promotion": true,
            "promotionDiscount": 0.15
        },
        {
            "asin": "0002551489",
            "description": "This wonderful series is the easiest way to sample some of the  world's finest cuisines from the comfort of your own kitchen.  Small in  size, yet large in recipe selection, each volume offers a delicious  range of dishes--from the simple to the imaginative.",
            "imUrl": "http://ecx.images-amazon.com/images/I/614WQDMDWWL.jpg",
            "price": 17.36,
            "title": "The Best of Mexico",
            "promotion": true,
            "promotionDiscount": 0.15
        },
        {
            "asin": "000255383X",
            "description": "From cocktail party chitchat, to bumper stickers, to personal ads--everything you'll ever need to say in perfect Latin! A backlistius bestsellerus.--This text refers to an alternateHardcoveredition.",
            "imUrl": "http://ecx.images-amazon.com/images/I/61HMJ7ZQEDL.jpg",
            "price": 9.99,
            "title": "Latin for All Occasions",
            "promotion": true,
            "promotionDiscount": 0.15
        },
        {
            "asin": "0002621509",
            "imUrl": "http://ecx.images-amazon.com/images/I/51Dqj5SBHqL.jpg",
            "price": 10.72,
            "title": "Alexander Dolgun's Story: An American in the Gulag",
            "promotion": true,
            "promotionDiscount": 0.15
        },
        {
            "asin": "0002726874",
            "description": "\"There is no doubt that it is one of the great personal memoirs of the Second World War.\"  --John Keegan&#8220;Fraser manages to capture the flavor of his comrades while so vividly portraying the grittiness of combat.&#8221;   --The Historical Novel Society--This text refers to an out of print or unavailable edition of this title.",
            "imUrl": "http://ecx.images-amazon.com/images/I/41FRF54J73L.jpg",
            "price": 9.06,
            "title": "Quartered Safe Out Here: A Recollection of the War in Burma",
            "promotion": true,
            "promotionDiscount": 0.15
        },
        {
            "asin": "0006135129",
            "description": "'A brilliant, overwhelming piece of descriptive writing.' Observer 'A story of exceptional courage which grips the imagination.' Daily Telegraph 'It deserves an honourable place among 20th-century war books.' Daily Mail 'HMS Ulysses is in the same class as The Cruel Sea.' Evening Standard",
            "imUrl": "http://ecx.images-amazon.com/images/I/51%2B3ro9OLKL.jpg",
            "price": 6.64,
            "title": "HMS Ulysses",
            "promotion": true,
            "promotionDiscount": 0.15
        },
        {
            "asin": "0006151329",
            "imUrl": "http://ecx.images-amazon.com/images/I/91APPM9lrrL.jpg",
            "price": 12.93,
            "title": "Merlin's Keep",
            "promotion": true,
            "promotionDiscount": 0.15
        },
        {
            "asin": "0006388515",
            "description": "'Magnificently enlightening and exciting.' --National Observer, Washington'The song of India...illuminated like scenes in a pageant.' --Time Magazine, New York'Thrilling...staggers the imagination.' --Daily Mail--This text refers to an out of print or unavailable edition of this title.",
            "imUrl": "http://ecx.images-amazon.com/images/I/51GDCCTQDDL.jpg",
            "price": 36.49,
            "title": "Freedom at Midnight",
            "promotion": true,
            "promotionDiscount": 0.15
        },
        {
            "asin": "0006472648",
            "description": "'Her forte is mood, atmosphere and the toe-curling frisson.' Sunday Times 'Readers of Barbara Erskine are held in thrall' Woman's Realm 'Stephen King meeting Ruth Rendell' Frank Delaney 'Barbara Erskine's storytelling talent is undeniable' The Times--This text refers to thePaperbackedition.",
            "imUrl": "http://ecx.images-amazon.com/images/I/51AZJ416CHL.jpg",
            "title": "Child of the Phoenix",
            "price": 38.0,
            "promotion": true,
            "promotionDiscount": 0.15
        },
        {
            "asin": "0006485944",
            "imUrl": "http://ecx.images-amazon.com/images/I/512WMEZXG6L.jpg",
            "price": 3.24,
            "title": "Dust",
            "promotion": true,
            "promotionDiscount": 0.15
        },
        {
            "asin": "0006513778",
            "description": "'Little masterpieces of detection. Poirot and Agatha Christie at their inimitable best.' Sunday Express",
            "imUrl": "http://ecx.images-amazon.com/images/I/71nM2YRWSjL.jpg",
            "price": 16.37,
            "title": "Hercule Poirot: The Complete Short Stories",
            "promotion": true,
            "promotionDiscount": 0.15
        },
        {
            "asin": "0006552021",
            "description": "'Fresh and original...Woolley thinks and writes beautifully. This is a distinguished and rather brilliant book - it's also a rattling good story.' Lisa Jardine 'A fascinating, brilliant account of the Renaissance world picture...' Kathryn Hughes, New Statesman 'Woolley handsomely captures a society torn between rationality and romance, cynicism and hero worship.' New Scientist 'An informative and enlightening book. It offers concise and lucid explanations of Dee's more abstruse and arcane theories. And it is immensely enjoyable, its narrative exciting and inexorable. I have not read as stimulating a study of the Elizabethan period since Charles Nicholl's book on Marlowe, \"The Reckoning\".' Thomas Wright, Daily Telegraph Praise for 'The Herbalist': 'The research is superb - rich, detailed, and original - and the lives Benjamin Woolley describes are as passionate as the great events of the English Civil War around which they orbit.' Adam Nicolson",
            "imUrl": "http://ecx.images-amazon.com/images/I/51A1BGB0BBL.jpg",
            "price": 7.59,
            "title": "The Queen's Conjuror: The Life and Magic of Dr. Dee",
            "promotion": true,
            "promotionDiscount": 0.15
        },
        {
            "asin": "0006917801",
            "description": "Originally published in hardcover beginning in 1964, these classicmystery/adventure stories feature three boys--Jupiter Jones, Pete Crenshaw, andBob Andrews--who establish a detective firm with the motto \"We InvestigateAnything!\" Perfect for summer reading, these suspenseful action stories willappeal to both boys and girls.--This text refers to an out of print or unavailable edition of this title.",
            "price": 12.82,
            "title": "The Secret of Terror Castle (Three Investigators)",
            "promotion": true,
            "promotionDiscount": 0.15
        },
        {
            "asin": "0007113080",
            "description": "Young Tobin had the misfortune of being born female in perilous times, in which high-born females of all ages are being murdered by order of the king, to ensure his son's succession to the throne. Years earlier, King Elrius usurped his sister's rightful claim to the throne--an act that abrogated the divine protections set over his people, bringing plague and war to the land. There are those who would see the divine prophecies honored, however, and a warrior queen restored to the throne. So Tobin is disguised by means of dark magic that conceals her true gender with that of her twin brother, who was killed at birth, but not fast enough. He drew a single breath, which was enough to keep his soul earthbound and horribly angry. Tobin will indeed be queen, but only if she can be protected until adulthood from her insane mother, her demonic brother, and every evil wizard in the land. This terrific tale is dark and exciting, and the magic in it is truly wonderful.Paula LuedtkeCopyright &#169; American Library Association. All rights reserved--This text refers to theMass Market Paperbackedition.",
            "imUrl": "http://ecx.images-amazon.com/images/I/51K57YDJESL.jpg",
            "price": 5.99,
            "title": "The Bone Doll's Twin (Tamir Triad)",
            "promotion": true,
            "promotionDiscount": 0.15
        },
        {
            "asin": "0007118481",
            "description": "Now A Major Motion Picture Starring Robert Carlyle and Kiefer Sutherland&#x91;Waking from a dream, I suddenly realized where I was: in the Death House&#x96;in a prison camp by the River Kwai. I was a prisoner of war, lying among the dead, waiting for the bodies to be carried away so that I might have more room.&#x92; When Ernest Gordon was twenty-four he was captured by the Japanese and forced, with other British prisoners, to build the notorious &#x91;Railroad of Death&#x92;, where nearly 16,000 Prisoners of War gave their life. Faced with the appalling conditions of the prisoners&#x92; camp and the brutality of the captors, he survived to become an inspiring example of the triumph of the human spirit against all odds.To End All Wars is Ernest Gordon&#x92;s gripping true story behind both the Academy Award-winning film The Bridge on the River Kwai starring Alec Guinness and the new film To End All Wars directed by David Cunningham.",
            "imUrl": "http://ecx.images-amazon.com/images/I/81y-yeepPLL.jpg",
            "price": 5.12,
            "title": "TO END ALL WARS",
            "promotion": true,
            "promotionDiscount": 0.15
        }
    ],
    "mostSales": [
        {
            "asin": "0441018521",
            "description": "Having an already exceptional series exceed your  expectations is a rare  and wonderful thing, but Andrews ... pulls it off with this  astonishing read. Put this on your auto-buy list immediately! --Romantic Times, 4 1/2 stars, TOP PICK, GOLD MEDAL",
            "imUrl": "http://ecx.images-amazon.com/images/I/51HONIk57pL.jpg",
            "price": 5.99,
            "title": "Magic Bleeds (Kate Daniels)",
            "promotion": false,
            "promotionDiscount": 0
        },
        {
            "asin": "000100039X",
            "description": "In a distant, timeless place, a mysterious prophet walks the sands. At the moment of his departure, he wishes to offer the people gifts but possesses nothing. The people gather round, each asks a question of the heart, and the man's wisdom is his gift. It is Gibran's gift to us, as well, for Gibran's prophet is rivaled in his wisdom only by the founders of the world's great religions. On the most basic topics--marriage, children, friendship, work, pleasure--his words have a power and lucidity that in another era would surely have provoked the description \"divinely inspired.\" Free of dogma, free of power structures and metaphysics, consider these poetic, moving aphorisms a 20th-century supplement to all sacred traditions--as millions of other readers already have.--Brian Bruya--This text refers to theHardcoveredition.",
            "imUrl": "http://ecx.images-amazon.com/images/I/81ZKLPivYUL.jpg",
            "price": 3.99,
            "title": "The Prophet",
            "promotion": false,
            "promotionDiscount": 0
        },
        {
            "asin": "0001473727",
            "imUrl": "http://ecx.images-amazon.com/images/I/512M299KGAL.jpg",
            "price": 2.99,
            "title": "The Greatest Book on Dispensational Truth in the World",
            "promotion": false,
            "promotionDiscount": 0
        },
        {
            "asin": "0001712772",
            "description": "Illus. in full color. Beginning readers can learn 100 different words in this story about a remarkable dog.&#160;&#160;--This text refers to theHardcoveredition.",
            "imUrl": "http://ecx.images-amazon.com/images/I/51HESAR69TL.jpg",
            "price": 7.69,
            "title": "I'll Teach My Dog 100 Words (Bright and Early Books)",
            "promotion": false,
            "promotionDiscount": 0
        },
        {
            "asin": "0002008572",
            "imUrl": "http://ecx.images-amazon.com/images/I/41PjujqMSKL.jpg",
            "price": 14.37,
            "title": "GOLD DIGGERS~STRIKING IT RICH IN THE KLONDIKE",
            "promotion": false,
            "promotionDiscount": 0
        },
        {
            "asin": "0002113570",
            "description": "\"An instant animal classic.\"   --Time\"Apart from its enormous scientific value, IN THE SHADOW OF MAN is absolutely fascinating to read as a story of discovery . . . The whole book is enthralling.\"  --Boston Globe\"I can't imagine a more vivid or unexpectedly moving introduction to chimpanzees in the wild than Jane Goodall's.\" -- George Stade  --The New York Times\"Jane Goodall's work with chimpanzees represents one of the Western world's great scientific achievements.\"   --Stephen Jay Gould--This text refers to an out of print or unavailable edition of this title.",
            "imUrl": "http://ecx.images-amazon.com/images/I/51iMi0zYqeL.jpg",
            "price": 12.1,
            "title": "In the Shadow of Man",
            "promotion": false,
            "promotionDiscount": 0
        },
        {
            "asin": "0002117088",
            "description": "Text: English (translation)Original Language: French--This text refers to thePaperbackedition.",
            "imUrl": "http://ecx.images-amazon.com/images/I/41isN3EczFL.jpg",
            "price": 12.47,
            "title": "Renoir, My Father",
            "promotion": false,
            "promotionDiscount": 0
        },
        {
            "asin": "000221685X",
            "imUrl": "http://ecx.images-amazon.com/images/I/514ouO3c0OL.jpg",
            "price": 96.0,
            "title": "the queen's confession",
            "promotion": false,
            "promotionDiscount": 0
        }
    ],
    "recommendList": [
        {
            "asin": "0061057649",
            "description": "InFeet of Clay, Terry Pratchett continues the fantasy adventures on  Discworld--where anything goes.  Anything but murder, that is. Commander Vimes of the Watch must investigate a puzzling series of deaths, with help  from various  trolls and dwarfs.  Pratchett's humor and excellent writing skills draw the reader effortlessly into his zany world.Feet of Clayis 19th in the series.--Blaise Selby",
            "imUrl": "http://ecx.images-amazon.com/images/I/51kg4At%2BQDL.jpg",
            "price": 6.83,
            "title": "Feet of Clay (Discworld)",
            "promotion": false,
            "promotionDiscount": 0
        },
        {
            "asin": "0061084026",
            "imUrl": "http://ecx.images-amazon.com/images/I/5104FJM4KYL.jpg",
            "price": 4.99,
            "title": "Conor's Way",
            "promotion": false,
            "promotionDiscount": 0
        },
        {
            "asin": "0061092193",
            "description": "Another wild romp through Discworld!  Corporal Carrot, a young  dwarf, is newly in charge of the recruits guarding Ankh-Morpork.  Edward, the 37th Lord d'Eath, has just discovered that Ankh-Morpork, kingless for generations, has a sovereign ruler, who must be convinced that he is, in fact, the King.  The fate of Ankh-Morpork rides on a young man's courage, an ancient sword's magic, and a three-legged poodle's bladder.--This text refers to an out of print or unavailable edition of this title.",
            "imUrl": "http://ecx.images-amazon.com/images/I/51CQrIh6n%2BL.jpg",
            "price": 8.54,
            "title": "Men at Arms",
            "promotion": false,
            "promotionDiscount": 0
        },
        {
            "asin": "0061994715",
            "description": "The voices of the game's distant past continue to reverberate with a distinct freshness in Lawrence S. Ritter'sThe Glory of Their Times.An oral history of the game in the first two decades of the century,Glorysends out its impressive roster of players to tell their own stories, and what stories they tell--the story of their times as well as of their game; the scorecard includes Rube Marquard, Babe Herman, Stan Coveleski, Smoky Joe Wood, and Wahoo Sam Crawford. A delight from cover to cover,Gloryis the next best thing to having been there in the days when the ball may have been dead, but the personalities were anything but.--This text refers to an alternatePaperbackedition.",
            "imUrl": "http://ecx.images-amazon.com/images/I/51bsZ992iLL.jpg",
            "price": 9.78,
            "title": "The Glory of Their Times: The Story of the Early Days of Baseball Told by the Men Who Played It (Harper Perennial Modern Classics)",
            "promotion": false,
            "promotionDiscount": 0
        },
        {
            "asin": "0062026542",
            "description": "Carson brings her well-wrought trilogy (The Girl of Fire and Thorns, 2011, and The Crown of Embers, 2012) to a satisfying conclusion as Elisa, bearer of the godstone that brings her both power and extreme danger, searches for her true love, Hector, captive of Franco&#x2019;s troops. Traveling with her trusted new maidservant as well as their prisoner, Storm, and the besotted Belen, Elisa must practice duplicity without falling victim to that of others. Romance, bravery, and suspenseful political wranglings drive and inform the characters on all sides. Readers new to the series should begin at its start, but, luckily, they&#x2019;ll have the whole series ahead of them as Elisa races to free Hector and take her rightful place of power. Grades 9-12. --Francisca Goldsmith",
            "imUrl": "http://ecx.images-amazon.com/images/I/61de2gjCzdL.jpg",
            "price": 10.99,
            "title": "The Bitter Kingdom (Girl of Fire and Thorns)",
            "promotion": false,
            "promotionDiscount": 0
        },
        {
            "asin": "006440577X",
            "description": "Ten-year-old Esther Rudomin movingly describes \"the end of my lovely world\" when her family is arrested in 1941 and taken from their home and exiled to Siberia. Ages 10-up.Copyright 1995 Reed Business Information, Inc.",
            "imUrl": "http://ecx.images-amazon.com/images/I/51eqXJyajGL.jpg",
            "price": 6.29,
            "title": "The Endless Steppe: Growing Up in Siberia",
            "promotion": false,
            "promotionDiscount": 0
        },
        {
            "asin": "014034912X",
            "description": "No Bio--This text refers to an out of print or unavailable edition of this title.",
            "imUrl": "http://ecx.images-amazon.com/images/I/7190APV04PL.gif",
            "price": 14.95,
            "title": "The Perilous Gard (Newbery Library, Puffin)",
            "promotion": false,
            "promotionDiscount": 0
        },
        {
            "asin": "014050446X",
            "description": "Rod Campbell is the creator of many brilliant novelty books for babies and toddlers including ABC Zoo, Farm Babies, Farm Chase, Farm 123 and Noisy Farm as well as Dear Zoo, regarded as a classic.",
            "imUrl": "http://ecx.images-amazon.com/images/I/51o4OZX2f1L.jpg",
            "price": 10.76,
            "title": "Dear Zoo (Lift-the-Flap)",
            "promotion": false,
            "promotionDiscount": 0
        },
        {
            "asin": "0152050523",
            "description": "",
            "imUrl": "http://ecx.images-amazon.com/images/I/5156-AAuAqL.jpg",
            "price": 15.38,
            "title": "The Enchanted Forest Chronicles: Dealing with Dragons / Searching for Dragons / Calling on Dragons / Talking to Dragons",
            "promotion": false,
            "promotionDiscount": 0
        },
        {
            "asin": "0156181924",
            "description": "In this retelling of the old French legend, a juggler offers to the Christ Child the only Christmas gift he has. &#x201C;The full-color pictures with subtle tonal modulations are an integral part of the design of the lumious pages full of movement and vitality. The Italianate aspects of the setting are beautifully realized.\"(The Horn Book)--This text refers to an out of print or unavailable edition of this title.",
            "imUrl": "http://ecx.images-amazon.com/images/I/51swO5V3rxL.jpg",
            "price": 16.26,
            "title": "The Clown of God",
            "promotion": false,
            "promotionDiscount": 0
        },
        {
            "asin": "0199731705",
            "description": "Starred Review. Too often, the Book of Mormon has been dismissed out of hand by scholars who think it a fraud (without having read it) or the faithful who accept it as gospel truth (without having read it carefully). In this long-overdue corrective, historian Hardy takes the Book of Mormon seriously as a complex, multivocal document by analyzing the contributions and perspectives of the three men who purport to be its primary narrators: Nephi, Mormon, and Moroni. Hardy teases out the unique voice of each narrator, showing particular nuance as a student of character. He has great skill in reading between the lines&mdash;in the Book of Mormon, what is implied is often more intriguing than what is made explicit, and the editorial omissions of a redactor like Mormon can be revealing gaps. In Hardy's hands, the Book of Mormon begins to come alive as a kind of Shakespearean tragedy as Hardy nimbly employs various tools of literary criticism. It is past time for a study like this, which eschews tiresome debates about the Book of Mormon's historical authenticity in favor of a careful, lucid exploration of the book's construction, themes, and characters. Hardy's writing is clear, sometimes even piercing. This will be a classic work in the field of Mormon studies for decades to come.(Apr.)Copyright &copy; Reed Business Information, a division of Reed Elsevier Inc. All rights reserved.",
            "imUrl": "http://ecx.images-amazon.com/images/I/41NAg%2BbAP8L.jpg",
            "price": 11.49,
            "title": "Understanding the Book of Mormon: A Reader's Guide",
            "promotion": false,
            "promotionDiscount": 0
        },
        {
            "asin": "0201310058",
            "description": "Written for the working Java developer, Joshua Bloch'sEffective Java Programming Language Guideprovides a truly  useful set of over 50 best practices and tips for writing better Java  code. With plenty of advice from an indisputable expert in the field,  this title is sure to be an indispensable resource for anyone who wants  to get more out of their code.As a veteran developer at Sun, the  author shares his considerable insight into the design choices made  over the years in Sun's own Java libraries (which the author  acknowledges haven't always been perfect). Based on his experience  working with Sun's best minds, the author provides a compilation of 57  tips for better Java code organized by category. Many of these ideas  will let you write more robust classes that better cooperate with  built-in Java APIs. Many of the tips make use of software patterns and  demonstrate an up-to-the-minute sense of what works best in today's  design. Each tip is clearly introduced and explained with code snippets  used to demonstrate each programming principle.Early sections on  creating and destroying objects show you ways to make better use of  resources, including how to avoid duplicate objects. Next comes an  absolutely indispensable guide to implementing \"required\" methods for  custom classes. This material will help you write new classes that  cooperate with old ones (with advice on implementing essential  requirements like theequals()andhashCode()methods).The author has a lot to say about class design, whether  using inheritance or composition. Tips on designing methods show you  how to create understandable, maintainable, and robust classes that can  be easily reused by others on your team. Sections on mapping C code  (like structures, unions, and enumerated types) onto Java will help C  programmers bring their existing skills to Sun's new language. Later  sections delve into some general programming tips, like using  exceptions effectively. The book closes with advice on using threads  and synchronization techniques, plus some worthwhile advice on object  serialization.Whatever your level of Java knowledge, this title can  make you a more effective programmer. Wisely written, yet never pompous  or doctrinaire, the author has succeeded in packaging some really  valuable nuggets of advice into a concise and very accessible guidebook  that arguably deserves a place on most any developer's bookshelf.--Richard DraganTopics covered:Best practices and tips for JavaCreating and destroying objects (static factory methods,  singletons, avoiding duplicate objects and finalizers)Required methods for custom classes (overridingequals(),hashCode(),toString(),clone(), andcompareTo()properly)Hints for class and interface design (minimizing class and member  accessibility, immutability, composition versus inheritance, interfaces  versus abstract classes, preventing subclassing, static versus  nonstatic classes)C constructs in Java (structures, unions, enumerated types, and  function pointers in Java)Tips for designing methods (parameter validation, defensive copies,  method signatures, method overloading, zero-length arrays, hints for  Javadoc comments)General programming advice (local variable scope, using Java API  libraries, avoidingfloatanddoublefor exact  comparisons, when to avoid strings, string concatenation, interfaces  and reflection, avoid native methods, optimizing hints, naming  conventions)Programming with exceptions (checked versus run-time exceptions,  standard exceptions, documenting exceptions, failure-capture  information, failure atomicity)Threading and multitasking (synchronization and scheduling hints,  thread safety, avoiding thread groups)Serialization (when to implementSerializable, thereadObject(), andreadResolve()methods)",
            "imUrl": "http://ecx.images-amazon.com/images/I/21DQBC4APYL.jpg",
            "price": 7.99,
            "title": "Effective Java: Programming Language Guide (Java Series)",
            "promotion": false,
            "promotionDiscount": 0
        },
        {
            "asin": "0307960307",
            "description": "Beloved illustrator J. P. Miller?s graphic, colorful farm animals seem to jump right off the page?but they aren?t jumping to help the Little Red Hen plant her wheat! Young children will learn a valuable lesson about teamwork from this funny, favorite folktale.--This text refers to an out of print or unavailable edition of this title.",
            "imUrl": "http://ecx.images-amazon.com/images/I/51EEaLbjbrL.jpg",
            "price": 2.14,
            "title": "The Little Red Hen (Little Golden Book)",
            "promotion": false,
            "promotionDiscount": 0
        },
        {
            "asin": "0316227706",
            "description": "Included inO, The Oprah Magazine'sholiday gift guide,Entertainment Weekly'sbest-selling gift books list, andThe Star-Ledger'sholiday gift guide.Seth Casteel's photographs are \"a global phenomenon.\" --Wired\"Surprising and funny.\" --New York Times\"A great coffee table book.\" --The Huffington Post\"These pictures are amazing and sometimes terrifying.\" --The New York Times Book Review's\"Inside the List\"\"The arresting portraits in Seth Casteel'sUnderwater Dogsreveal what's happening below the surface. Teeth gnashing, paws paddling, primal and hilarious, these canines bubble with irresistible energy.\" --O, The Oprah Magazine\"Seth Casteel's photos of dogs diving into swimming pools in hot pursuit of neon tennis balls have been a sensation.\" --Washington Post\"Wide-eyed, wet-haired dog portraiture.\" --Los Angeles Times\"The gorgeous, energetic snapshots are special in that they capture our pets in a primal state we rarely get to see.\" --Entertainment Weekly'sShelf Life\"Different from anything you've seen before.\" -- CNN.com\"Alternately gorgeous and terrifying, but always visually sumptuous.\" --Entertainment Weekly\"It's impossible to look at Under&shy;water Dogs without smiling.... A delight-inducing book.\" --BookPage\"Every image in this fetching work bubbles with life, reminding the reader that even in the most lovable and domesticated dog, there may be more primal forces at work.\" --Publishers Weekly\"The most popular photography book of 2012.\" --The San Francisco Chronicle\"If you're as much of a sucker for great animal photos as I am, you'll love this different take on man's best friend.\" -- Melanie Stetson Freeman,Christian Science Monitor\"Alternately humorous, rejuvenating, and even a little scary, these pictures of man's best friend in man's most essential liquid make us wonder why someone didn't think of taking pictures like this sooner.\" -- Complex.com\"Award-winning photographer Casteel captures his range of subjects with great affection and the variety of expressions and acrobatic poses will keep you chuckling for hours.\" --The Daily Mail\"These aqua-doggies are guaranteed to bring a smile to almost any face as they become a whimsically single-minded parade of bared teeth and whooshing paws going after the balls and other objects that Casteel tossed into his pool just before clicking away on his underwater camera.\" --American Profile\"Now we know exactly what to put on our holiday wish list!\" -- pawnation.com\"... it's the gleeful images of dogs plunging into swimming pools, chomping after their favorite toys, that have put Casteel on the map as one of this country's premier - and innovative - pet photographers.\" -- petsugar.com\"Photographer Seth Casteel has done an unimaginable thing: he's created an entire photography book of dogs from an underwater perspective, and the photos are simply stunning.... Casteel is not only an animal lover but also an animal rescuer, and his genuine love of dogs shines through in his work.\" --Babble Pets\"Dogs expressing their graceful and goofy selves while swimming.\" -- vetstreet.com",
            "imUrl": "http://ecx.images-amazon.com/images/I/51aaB8WCfcL.jpg",
            "price": 9.99,
            "title": "Underwater Dogs",
            "promotion": false,
            "promotionDiscount": 0
        },
        {
            "asin": "0316545120",
            "description": "''Manchester is not only a master of detail but also of 'the big picture' . . . I daresay most Americans readingThe Last Lionwill relish it immensely.'' --National Review''[Manchester] can claim the considerable achievement of having assembled enough powerful evidence to support Isaiah Berlin's judgment of Churchill as the largest human being of our time.'' --Alistair Cooke--This text refers to theAudio CDedition.",
            "imUrl": "http://ecx.images-amazon.com/images/I/51ZJSzyFgyL.jpg",
            "price": 14.99,
            "title": "The Last Lion: Winston Spencer Churchill, Alone 1932-1940",
            "promotion": false,
            "promotionDiscount": 0
        },
        {
            "asin": "0321316274",
            "description": "Katrin Eismann is an internationally respected teacher and lecturer on  photographic imaging, restoration, retouching, and the impact ofemerging technologies on photography and the arts. Katrin received an  undergraduate degree in photographic illustration from the Rochester  Institute of Technology and her Master of Fine Arts degree in design at  the School of Visual Arts in New York City. Her other books include  Photoshop Masking &amp; Compositing and Real World Digital Photography.In 2005, she was inducted into the Photoshop Hall of Fame by the  National Association of Photoshop Professionals. Wayne Palmer is the  principal of Palmer Multimedia Imaging, which offers custom  photography, video, and restoration services. Wayne has worked with  Adobe Photoshop since version 3; teaches Photoshop and digital  photography classes; and is the technical editor of numerous books on  digital imaging techniques.",
            "imUrl": "http://ecx.images-amazon.com/images/I/5154igecQWL.jpg",
            "price": 17.61,
            "title": "Adobe Photoshop Restoration &amp; Retouching (3rd Edition)",
            "promotion": false,
            "promotionDiscount": 0
        },
        {
            "asin": "0321334116",
            "description": "David Blatneris an internationally known expert on Photoshop and QuarkXPress and is the author of numerous other books, including Real World QuarkXPress and Real World Adobe InDesign. David lectures on desktop publishing and multimedia at conferences and workshops around the world. Co-author,Bruce Fraser, is an internationally known authority on digital imaging and color reproduction. In addition to speaking and consulting on these topics, he is the author of Real World Camera Raw with Adobe Photoshop; the co-author of Real World Color Management, the definitive guide to color management systems; and a contributing editor for Macworld magazine and creativepro.com.",
            "imUrl": "http://ecx.images-amazon.com/images/I/51g3ZTXK9iL.jpg",
            "price": 5.26,
            "title": "Real World Adobe Photoshop CS2",
            "promotion": false,
            "promotionDiscount": 0
        },
        {
            "asin": "0345027922",
            "imUrl": "http://ecx.images-amazon.com/images/I/51aqO%2BazRJL.jpg",
            "price": 12.02,
            "title": "Fate Is the Hunter",
            "promotion": false,
            "promotionDiscount": 0
        },
        {
            "asin": "0345515595",
            "description": "\"Gripping! Vivid characters, superior world-building and a wonderful sense of pace! I was enthralled.\" \"The world-building is unexpected and complex, the characters are alive, and the protagonist Chess is a treasure.\" \"The characters are complex and indelible, the plot is fascinating, and I can hardly wait for another book!\" (all) Charlaine Harris--This text refers to thePaperbackedition.",
            "imUrl": "http://ecx.images-amazon.com/images/I/516Y1EHZI-L.jpg",
            "price": 4.27,
            "title": "City of Ghosts (Downside Ghosts)",
            "promotion": false,
            "promotionDiscount": 0
        },
        {
            "asin": "034552750X",
            "description": "''Kane delivers dark, sexy urban fantasy at its finest.'' --Karen Marie Moning, #1New York Timesbestselling author''Whether [the reader's heart] is pounding in fear or breaking in sympathy, this book was satisfying on pretty much every level . . . This is such an addictive, compelling series.'' --Urban Fantasy Book Reviews(five stars)--This text refers to theMP3 CDedition.",
            "imUrl": "http://ecx.images-amazon.com/images/I/51utycDJlNL.jpg",
            "price": 5.99,
            "title": "Sacrificial Magic (Downside Ghosts)",
            "promotion": false,
            "promotionDiscount": 0
        },
        {
            "asin": "0373776039",
            "description": "\"An addictively readable tale of revenge and redemption, love and family, Unveiled is brilliant.\"&#8211; Booklist\"An exquisitely sensual and unforgettable romance by one of the genre's incandescent new stars.\"-Booklist (starred review) on Trial by Desire\"Historical romance fans will celebrate Milan's powerhouse debut, which comes with a full complement of humor, characterization, plot and sheer gutsiness.\"-Publishers Weekly (starred review) on Proof by Seduction\"A brilliant debut...deeply romantic, sexy and smart.\"-New York Times bestselling author Eloisa James on Proof by Seduction",
            "imUrl": "http://ecx.images-amazon.com/images/I/51GtjVXkZGL.jpg",
            "price": 0.99,
            "title": "Unclaimed (Hqn)",
            "promotion": false,
            "promotionDiscount": 0
        },
        {
            "asin": "0373861672",
            "imUrl": "http://ecx.images-amazon.com/images/I/51m4bcrtwrL.jpg",
            "price": 4.35,
            "title": "Recipe for Temptation (Kimani Romance)",
            "promotion": false,
            "promotionDiscount": 0
        },
        {
            "asin": "0375423214",
            "description": "In a style reminiscent ofMonty Pythonand Douglas Adams (or so the publisher asserts) comes this tiny tome from fledgling author Defoe, set in the early 1800s (although filled with anachronisms such as Post-it Notes and dental floss). The adventure begins as the pirate captain (none of the crew have names, just descriptions, such as the \"pirate with the red scarf\" and the \"pirate dressed in green\") mistakes Charles Darwin's ship,Beagle, for a treasure ship from the Bank of England and boards it. Darwin's only claim to fame at this point is that he has taught an ape--a Man-panzee by the name of Mr. Bobo--to behave as a proper, albeit speechless, English gentleman. The pirate captain and Darwin, now chums, head back to England to rescue Darwin's brother, who has been abducted by the evil bishop of Oxford. Once in foggy London, the pirates encounter damsels in distress, nefarious schemes, and even the Elephant Man. Aficionados of outre British humor should find this amusing.Michael GannonCopyright &#169; American Library Association. All rights reserved",
            "imUrl": "http://ecx.images-amazon.com/images/I/515B8J3RVNL.jpg",
            "price": 16.95,
            "title": "The Pirates! In an Adventure with Scientists: A Novel",
            "promotion": false,
            "promotionDiscount": 0
        },
        {
            "asin": "0380001411",
            "description": "When Christy Huddleston leaves a life of privilege and ease to teach in the impoverished Smokey Mountains, her faith is severely tested by her pupils, the love of two men, and the curious customs of the mountain people in her community. Yet she grows to love these people and the simple, fulfilling lifestyle to be found in the heart of God's country.  First released in 1967,Christyis based on the life of author Catherine Marshall's mother and was the inspiration for the recent television series of the same name.  Beautifully told, this is a charming, timeless tale of love and faith that will appeal to romance readers of all ages.--Maudeen Wachsmith",
            "imUrl": "http://ecx.images-amazon.com/images/I/81JMTSVJLPL.jpg",
            "price": 14.97,
            "title": "Christy",
            "promotion": false,
            "promotionDiscount": 0
        },
        {
            "asin": "0380818612",
            "description": "In this sequel to The Curse of Chalion (2001), rich in sumptuous detail and speculative theology, dowager royina Ista Dy Baocia undertakes a pilgrimage to ease her soul-and finds instead that in Chalion, Bujold's handsomely crafted fantasy world ruled by Five Gods \"just around some strange corner of perception,\" a more dangerous fate awaits than she could ever have imagined. Swordplay and sorcery sweep sensitive, sensible 40-year-old Ista into Chalion's border stronghold of Porifors, where enemy Roknari incursions and demons from the Fifth God's hell threaten Ista's realm, held precariously at bay by the charismatic Arhys dy Lutez. Ista's romantic quest to save Arhys and his magnetic half-brother, Illvin, teems with equal parts of unearthly magic and down-to-earth quasi-medieval lore. Despite an occasional lapse into adolescent angst and spurts of superficial dialogue, high fantasy fans should thrill at Ista's spiritual perils, while horse admirers of all ages should savor even Ista's saddle sores. This engaging installment of Chalion's mythical history whets the appetite for new marvels yet to come. FYI: Bujold has won both Hugo and Nebula awards.Copyright 2003 Reed Business Information, Inc.--This text refers to an out of print or unavailable edition of this title.",
            "imUrl": "http://ecx.images-amazon.com/images/I/51VUgStY%2BPL.jpg",
            "price": 6.28,
            "title": "Paladin of Souls",
            "promotion": false,
            "promotionDiscount": 0
        }
    ]
}
